const accordionData = {
    "Наша миссия": {
        data: [
            { title: "КОНТЕЙНЕРНЫЕ ПЕРЕВОЗКИ", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "АВТОМОБИЛЬНЫЕ ПЕРЕВОЗКИ", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "АВТОМОБИЛЬНЫЕ ПЕРЕВОЗКИ", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "АВТОМОБИЛЬНЫЕ ПЕРЕВОЗКИ", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "АВТОМОБИЛЬНЫЕ ПЕРЕВОЗКИ", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
        ]
    },
    "Наша версия": {
        data: [
            { title: "Наша версия", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Наша версия", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Наша версия", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Наша версия", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Наша версия", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
        ]
    },
    "Наш инструмент": {
        data: [
            { title: "Наш инструмент", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Наш инструмент", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Наш инструмент", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Наш инструмент", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Наш инструмент", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
        ]
    },
    "Комментарии клиентов": {
        data: [
            { title: "Комментарии клиентов", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Комментарии клиентов", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Комментарии клиентов", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Комментарии клиентов", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
            { title: "Комментарии клиентов", text: "Господа, базовый вектор развития является качественно новой ступенью модели развития. определенных слоев населения, а значит, должны быть представлены в исключительно положительном свете. Сложно сказать, почему интерактивные прототипы являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Лишь стремящиеся вытеснить традиционное производство." },
        ]
    },
}

const accordion = document.getElementById("accordion")
const btnGroup = document.getElementById("btnGroup")

function accordionMap(name) {
    accordionData[name].data.map((elem, i) => {
        const accordionBox = document.createElement("div");
        accordionBox.className = "accordion-box"
        accordionBox.innerHTML = `
            <button class="accordion-box-accordionBtn" onclick="openAccordion(event)">
                ${elem.title} <span></span>
            </button>
            <div class="accordion-box-panel">
                <p>${elem.text}</p>
            </div>
        `
        accordion.appendChild(accordionBox)
    })
}

function setAccordion() {
    accordionMap("Наша миссия");
}

setAccordion()

const changeAccordion = (name, event) => {
    accordion.innerHTML = '';
    accordionMap(name);
    for (var i = 0; i < btnGroup.children.length; i++) {
        btnGroup.children[i].classList.remove("active");
    }
    event.currentTarget.classList.add("active")
}

const openAccordion = (event) => {
    if (event.currentTarget.parentNode.classList.contains("active")) {
        event.currentTarget.parentNode.classList.remove("active");
        event.currentTarget.parentNode.children[1].style.maxHeight = null;
    } else {
        event.currentTarget.parentNode.classList.add("active");
        event.currentTarget.parentNode.children[1].style.maxHeight = event.currentTarget.parentNode.children[1].scrollHeight + "px";
    }
}